In [1]:
from datascience import *

import numpy as np
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
from seaborn import load_dataset

In [2]:
#reading csv files
cab = pd.read_csv('Cab_Data.csv')
city = pd.read_csv('City.csv')
customer_id= pd.read_csv('Customer_ID.csv')
transaction_id = pd.read_csv('Transaction_ID.csv')

In [3]:
cab

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,1/8/2016,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10000012,1/6/2016,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
2,10000013,1/2/2016,Pink Cab,ATLANTA GA,9.04,125.20,97.6320
3,10000014,1/7/2016,Pink Cab,ATLANTA GA,33.17,377.40,351.6020
4,10000015,1/3/2016,Pink Cab,ATLANTA GA,8.73,114.62,97.7760
...,...,...,...,...,...,...,...
359387,10440101,1/8/2018,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,1/4/2018,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,1/5/2018,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,1/5/2018,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,1/2/2018,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

In [4]:
city

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [5]:
customer_id

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [6]:
transaction_id

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [7]:
transactions_of_customers = pd.merge(customer_id, transaction_id, on = "Customer ID")

In [8]:
#transactions_of_customers

In [9]:
cabs_of_customers = pd.merge(cab, transactions_of_customers, on = "Transaction ID")

In [10]:
#cabs_of_customers

In [11]:
city_data_cabs = pd.merge(city, cabs_of_customers, on = "City")

In [12]:
#city_data_cabs

In [13]:
cleaned_cityDataCabs = city_data_cabs.drop_duplicates()

In [14]:
#cleaned_cityDataCabs

In [15]:
cleaned_cityDataCabs = cleaned_cityDataCabs.sort_values(["City", "Company", "Gender", "Age", "Income (USD/Month)", "Payment_Mode", "Price Charged"])

In [16]:
cleaned_cityDataCabs

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode
256941,ATLANTA GA,"814,885","24,701",10225532,9/23/2017,Pink Cab,22.08,210.12,262.752,29108,Female,18,3944,Card
255959,ATLANTA GA,"814,885","24,701",10171654,5/7/2017,Pink Cab,29.12,445.50,346.528,29108,Female,18,3944,Card
255661,ATLANTA GA,"814,885","24,701",10153732,3/21/2017,Pink Cab,26.75,322.52,283.550,27514,Female,18,3991,Card
255476,ATLANTA GA,"814,885","24,701",10141256,2/3/2017,Pink Cab,37.45,528.12,419.440,27514,Female,18,3991,Card
260215,ATLANTA GA,"814,885","24,701",10415887,11/30/2018,Pink Cab,33.00,380.54,372.900,28347,Female,18,6439,Card
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318118,WASHINGTON DC,"418,859","127,001",10347642,7/6/2018,Yellow Cab,4.20,55.83,57.960,51285,Male,65,34100,Cash
290480,WASHINGTON DC,"418,859","127,001",10072023,8/28/2016,Yellow Cab,8.55,130.94,110.808,51285,Male,65,34100,Cash
294023,WASHINGTON DC,"418,859","127,001",10108963,11/19/2016,Yellow Cab,19.00,294.68,246.240,51285,Male,65,34100,Cash
308770,WASHINGTON DC,"418,859","127,001",10257135,11/10/2017,Yellow Cab,29.16,434.46,384.912,51285,Male,65,34100,Cash
288129,WASHINGTON DC,"418,859","127,001",10046968,6/18/2016,Yellow Cab,43.60,916.43,549.360,51285,Male,65,34100,Cash

In [27]:
# apply the dtype attribute
result = cleaned_cityDataCabs.dtypes

print("Output:")
print(result)

Output:
City                          object
Population                    object
Users                         object
Transaction ID                 int64
Date of Travel        datetime64[ns]
Company                       object
KM Travelled                 float64
Price Charged                float64
Cost of Trip                 float64
Customer ID                    int64
Gender                        object
Age                            int64
Income (USD/Month)             int64
Payment_Mode                  object
day                            int64
month                          int64
year                           int64
dtype: object

In [19]:
#checking for duplications
cleaned_cityDataCabs[cleaned_cityDataCabs.duplicated(keep=False)].shape[0]

0

In [20]:
#checking for N/A values
cleaned_cityDataCabs.isna().any().any()

False

In [22]:
cleaned_cityDataCabs['Date of Travel'] = pd.to_datetime(cleaned_cityDataCabs['Date of Travel'])
cleaned_cityDataCabs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 359392 entries, 256941 to 288129
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   City                359392 non-null  object
 1   Population          359392 non-null  object
 2   Users               359392 non-null  object
 3   Transaction ID      359392 non-null  int64
 4   Date of Travel      359392 non-null  datetime64[ns]
 5   Company             359392 non-null  object
 6   KM Travelled        359392 non-null  float64
 7   Price Charged       359392 non-null  float64
 8   Cost of Trip        359392 non-null  float64
 9   Customer ID         359392 non-null  int64
 10  Gender              359392 non-null  object
 11  Age                 359392 non-null  int64
 12  Income (USD/Month)  359392 non-null  int64
 13  Payment_Mode        359392 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(4), object(6)
memory usage: 41.1+ MB

In [23]:
cleaned_cityDataCabs['day'] = cleaned_cityDataCabs['Date of Travel'].dt.day
cleaned_cityDataCabs['month'] = cleaned_cityDataCabs['Date of Travel'].dt.month
cleaned_cityDataCabs['year'] = cleaned_cityDataCabs['Date of Travel'].dt.year

In [30]:
cleaned_cityDataCabs = cleaned_cityDataCabs.sort_values(["City", "Company", "Gender", "Age", "Income (USD/Month)", "Payment_Mode", "Price Charged"])

In [31]:
cleaned_cityDataCabs

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode,day,month,year
256941,ATLANTA GA,"814,885","24,701",10225532,2017-09-23,Pink Cab,22.08,210.12,262.752,29108,Female,18,3944,Card,23,9,2017
255959,ATLANTA GA,"814,885","24,701",10171654,2017-05-07,Pink Cab,29.12,445.50,346.528,29108,Female,18,3944,Card,7,5,2017
255661,ATLANTA GA,"814,885","24,701",10153732,2017-03-21,Pink Cab,26.75,322.52,283.550,27514,Female,18,3991,Card,21,3,2017
255476,ATLANTA GA,"814,885","24,701",10141256,2017-02-03,Pink Cab,37.45,528.12,419.440,27514,Female,18,3991,Card,3,2,2017
260215,ATLANTA GA,"814,885","24,701",10415887,2018-11-30,Pink Cab,33.00,380.54,372.900,28347,Female,18,6439,Card,30,11,2018
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318118,WASHINGTON DC,"418,859","127,001",10347642,2018-07-06,Yellow Cab,4.20,55.83,57.960,51285,Male,65,34100,Cash,6,7,2018
290480,WASHINGTON DC,"418,859","127,001",10072023,2016-08-28,Yellow Cab,8.55,130.94,110.808,51285,Male,65,34100,Cash,28,8,2016
294023,WASHINGTON DC,"418,859","127,001",10108963,2016-11-19,Yellow Cab,19.00,294.68,246.240,51285,Male,65,34100,Cash,19,11,2016
308770,WASHINGTON DC,"418,859","127,001",10257135,2017-11-10,Yellow Cab,29.16,434.46,384.912,51285,Male,65,34100,Cash,10,11,2017
288129,WASHINGTON DC,"418,859","127,001",10046968,2016-06-18,Yellow Cab,43.60,916.43,549.360,51285,Male,65,34100,Cash,18,6,2016

In [28]:
pinkcab = cleaned_cityDataCabs[cleaned_cityDataCabs["Company"] == "Pink Cab"]
pinkcab

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode,day,month,year
256941,ATLANTA GA,"814,885","24,701",10225532,2017-09-23,Pink Cab,22.08,210.12,262.752,29108,Female,18,3944,Card,23,9,2017
255959,ATLANTA GA,"814,885","24,701",10171654,2017-05-07,Pink Cab,29.12,445.50,346.528,29108,Female,18,3944,Card,7,5,2017
255661,ATLANTA GA,"814,885","24,701",10153732,2017-03-21,Pink Cab,26.75,322.52,283.550,27514,Female,18,3991,Card,21,3,2017
255476,ATLANTA GA,"814,885","24,701",10141256,2017-02-03,Pink Cab,37.45,528.12,419.440,27514,Female,18,3991,Card,3,2,2017
260215,ATLANTA GA,"814,885","24,701",10415887,2018-11-30,Pink Cab,33.00,380.54,372.900,28347,Female,18,6439,Card,30,11,2018
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
293553,WASHINGTON DC,"418,859","127,001",10102919,2016-11-06,Pink Cab,5.88,77.29,64.680,53399,Male,65,19152,Card,6,11,2016
289917,WASHINGTON DC,"418,859","127,001",10064946,2016-08-20,Pink Cab,12.12,150.28,136.956,53399,Male,65,19152,Cash,20,8,2016
325731,WASHINGTON DC,"418,859","127,001",10429779,2018-12-21,Pink Cab,13.68,194.81,147.744,53602,Male,65,21542,Card,21,12,2018
287776,WASHINGTON DC,"418,859","127,001",10043314,2016-06-12,Pink Cab,28.80,386.90,322.560,52390,Male,65,23302,Card,12,6,2016
294885,WASHINGTON DC,"418,859","127,001",10117302,2016-12-03,Pink Cab,40.56,743.07,417.768,51391,Male,65,30238,Card,3,12,2016

In [33]:
yellowcab = cleaned_cityDataCabs[cleaned_cityDataCabs["Company"] == "Yellow Cab"]
yellowcab

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode,day,month,year
255581,ATLANTA GA,"814,885","24,701",10147821,2017-02-24,Yellow Cab,7.02,164.98,96.0336,27246,Female,18,2828,Card,24,2,2017
255858,ATLANTA GA,"814,885","24,701",10165367,2017-04-23,Yellow Cab,35.52,635.59,490.1760,27246,Female,18,2828,Card,23,4,2017
257687,ATLANTA GA,"814,885","24,701",10267254,2017-11-30,Yellow Cab,37.83,705.70,544.7520,27246,Female,18,2828,Card,30,11,2017
255220,ATLANTA GA,"814,885","24,701",10125241,2016-12-18,Yellow Cab,37.62,688.06,523.6704,27246,Female,18,2828,Cash,18,12,2016
255332,ATLANTA GA,"814,885","24,701",10132387,2017-01-05,Yellow Cab,6.65,99.02,95.7600,29399,Female,18,2989,Card,5,1,2017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318118,WASHINGTON DC,"418,859","127,001",10347642,2018-07-06,Yellow Cab,4.20,55.83,57.9600,51285,Male,65,34100,Cash,6,7,2018
290480,WASHINGTON DC,"418,859","127,001",10072023,2016-08-28,Yellow Cab,8.55,130.94,110.8080,51285,Male,65,34100,Cash,28,8,2016
294023,WASHINGTON DC,"418,859","127,001",10108963,2016-11-19,Yellow Cab,19.00,294.68,246.2400,51285,Male,65,34100,Cash,19,11,2016
308770,WASHINGTON DC,"418,859","127,001",10257135,2017-11-10,Yellow Cab,29.16,434.46,384.9120,51285,Male,65,34100,Cash,10,11,2017
288129,WASHINGTON DC,"418,859","127,001",10046968,2016-06-18,Yellow Cab,43.60,916.43,549.3600,51285,Male,65,34100,Cash,18,6,2016

In [ ]:
#Until now I cleaned, merged and controled data sets. Also, I converted data type and seperated to "Date of Travel" to analyse it easily later. After here, I'm gonna visualize my data and try to conclude.